// Задание 5
console.log('Задание 5');

//Правильный порядок:

//Прошла одна секунда
//Привет, Глеб!

// Функция delayForSecond через 1 секунду пишет в консоль «Прошла одна секунда», 
// а затем вызывает переданный колбэк
function delayForSecond(cb) {
    setTimeout(() => {
        console.log('Прошла одна секунда');
        if (cb) { cb(); }
    }, 1000)
}
// Функция sayHi выводит в консоль приветствие для указанного имени
function sayHi(name) {
    console.log(`Привет, ${name}!`);
}
// Код выше менять нельзя

// Нужно изменить код ниже:

delayForSecond(sayHi('Глеб'))